In [1]:
#pandas

In [3]:
import pandas as pd

In [5]:
data = {
    'Name': ['Sakshi', 'Aman', 'Riya'],
    'Age': [24, 25, 23],
    'Score': [88, 92, 79]
}
df = pd.DataFrame(data)

In [9]:
df.head()           # First 5 rows

     Name  Age  Score
0  Sakshi   24     88
1    Aman   25     92
2    Riya   23     79

In [11]:
df.tail(2)          # Last 2 rows

   Name  Age  Score
1  Aman   25     92
2  Riya   23     79

In [13]:
df.shape            # (rows, columns)

(3, 3)

In [15]:
df.columns          # List of column names

Index(['Name', 'Age', 'Score'], dtype='object')

In [17]:
df.info()           # Summary of data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Score   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [19]:
df.describe()       # Statistical summary

        Age      Score
count   3.0   3.000000
mean   24.0  86.333333
std     1.0   6.658328
min    23.0  79.000000
25%    23.5  83.500000
50%    24.0  88.000000
75%    24.5  90.000000
max    25.0  92.000000

In [21]:
df['Name']                  # Single column

0    Sakshi
1      Aman
2      Riya
Name: Name, dtype: object

In [23]:
df[['Name', 'Score']]       # Multiple columns

     Name  Score
0  Sakshi     88
1    Aman     92
2    Riya     79

In [25]:
df.iloc[0]                  # First row (by index)

Name     Sakshi
Age          24
Score        88
Name: 0, dtype: object

In [27]:
df.loc[0, 'Age']            # Specific cell

24

In [29]:
df[df['Age'] > 23]                      # Age > 23

     Name  Age  Score
0  Sakshi   24     88
1    Aman   25     92

In [31]:
df[(df['Age'] > 23) & (df['Score'] > 85)]  # Multiple conditions

     Name  Age  Score
0  Sakshi   24     88
1    Aman   25     92

In [55]:
df['Passed'] = df['Score'] > 87         # Add new column

In [57]:
df['Score'] = df['Score'] + 5           # Update column

In [59]:
df.head()

     Name  Age  Score  Passed
0  Sakshi   24    103    True
1    Aman   25    107    True
2    Riya   23     94    True

In [61]:
df.isnull()                             # Check for NaN

    Name    Age  Score  Passed
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False

In [63]:
df.dropna()                             # Drop rows with NaN

     Name  Age  Score  Passed
0  Sakshi   24    103    True
1    Aman   25    107    True
2    Riya   23     94    True

In [65]:
df.fillna(0)                            # Fill NaN with 0

     Name  Age  Score  Passed
0  Sakshi   24    103    True
1    Aman   25    107    True
2    Riya   23     94    True

In [69]:
df.sort_values('Score')                # Sort by Score

     Name  Age  Score  Passed
2    Riya   23     94    True
0  Sakshi   24    103    True
1    Aman   25    107    True

In [71]:
df.sort_values('Age', ascending=False)

     Name  Age  Score  Passed
1    Aman   25    107    True
0  Sakshi   24    103    True
2    Riya   23     94    True

In [77]:
df.sort_values('Score')                # Sort by Score

     Name  Age  Score  Passed
2    Riya   23     94    True
0  Sakshi   24    103    True
1    Aman   25    107    True

In [79]:
df.sort_values('Age', ascending=False)

     Name  Age  Score  Passed
1    Aman   25    107    True
0  Sakshi   24    103    True
2    Riya   23     94    True